In [ ]:
import pandas as pd
from sklearn.tree import DecisionTreeClassifier

In [ ]:
#Lendo conjunto de teste e treino
train = pd.read_csv('train.csv')
test = pd.read_csv('test.csv')

In [ ]:
#Cinco primeiras linhas do conjunto de dados de treino
#o metodo drop remove as colunas
train.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [ ]:
#retirando colunas com nome, ingresso e cabine dos conjuntos
train.drop(['Name', 'Ticket', 'Cabin'], axis=1, inplace=True)
test.drop(['Name', 'Ticket', 'Cabin'], axis=1, inplace=True)

In [ ]:
#criação de novo Dataframe a partir do One-hot encoding
new_data_train = pd.get_dummies(train)
new_data_test = pd.get_dummies(test)

In [ ]:
new_data_test.head()

   PassengerId  Pclass   Age  ...  Embarked_C  Embarked_Q  Embarked_S
0          892       3  34.5  ...           0           1           0
1          893       3  47.0  ...           0           0           1
2          894       2  62.0  ...           0           1           0
3          895       3  27.0  ...           0           0           1
4          896       3  22.0  ...           0           0           1

[5 rows x 11 columns]

In [ ]:
new_data_train.head()

   PassengerId  Survived  Pclass  ...  Embarked_C  Embarked_Q  Embarked_S
0            1         0       3  ...           0           0           1
1            2         1       1  ...           1           0           0
2            3         1       3  ...           0           0           1
3            4         1       1  ...           0           0           1
4            5         0       3  ...           0           0           1

[5 rows x 12 columns]

In [ ]:
#Quantidade de vaores nulos no conjunto de treino
new_data_train.isnull().sum().sort_values(ascending=False).head(10)

Age           177
Embarked_S      0
Embarked_Q      0
Embarked_C      0
Sex_male        0
Sex_female      0
Fare            0
Parch           0
SibSp           0
Pclass          0
dtype: int64

In [ ]:
#Preenchendo valores nulos
new_data_train['Age'].fillna(new_data_train['Age'].mean(), inplace=True)
new_data_test['Age'].fillna(new_data_test['Age'].mean(), inplace=True)

In [ ]:
#Quantidade de valores nulos no conjuto de teste
new_data_test.isnull().sum().sort_values(ascending=False).head(10)

Fare          1
Embarked_S    0
Embarked_Q    0
Embarked_C    0
Sex_male      0
Sex_female    0
Parch         0
SibSp         0
Age           0
Pclass        0
dtype: int64

In [ ]:
#Preenchendo valores nulos
new_data_test['Fare'].fillna(new_data_test['Age'].mean(), inplace=True)

In [ ]:
#Separando features e target para criação do modelo
x = new_data_train.drop('Survived', axis=1)
y = new_data_train['Survived']

In [ ]:
#Criação do modelo
tree = DecisionTreeClassifier(max_depth=3, random_state=0)
tree.fit(x, y)

DecisionTreeClassifier(ccp_alpha=0.0, class_weight=None, criterion='gini',
                       max_depth=3, max_features=None, max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, presort='deprecated',
                       random_state=0, splitter='best')

In [ ]:
#Verificando score no conjunto de treino
tree.score(x, y)

0.8271604938271605

In [ ]:
submission = pd.DataFrame()
submission['PassengerId'] = new_data_test['PassengerId']
submission['Survived'] = tree.predict(new_data_test)

In [ ]:
submission.to_csv('submission.csv', index=False)